nieaowei/newlab-stm32-driver/LCD模块/LCD驱动实验/LCD_TOUCH/USER/LCD/GLCD_MCBSTM32EX.c
        /* Power On sequence -----------------------------------------------------*/
        wr_reg(0x10, 0x0000);               /* Reset Power Control 1              */
        wr_reg(0x11, 0x0000);               /* Reset Power Control 2              */
        wr_reg(0x12, 0x0000);               /* Reset Power Control 3              */
        wr_reg(0x13, 0x0000);               /* Reset Power Control 4              */
        delay_ms(200);                      /* Discharge cap power voltage (200ms)*/
        wr_reg(0x10, 0x12B0);               /* SAP, BT[3:0], AP, DSTB, SLP, STB   */
        wr_reg(0x11, 0x0007);               /* DC1[2:0], DC0[2:0], VC[2:0]        */
        delay_ms(50);                       /* Delay 50 ms                        */
        wr_reg(0x12, 0x01BD);               /* VREG1OUT voltage                   */
        delay_ms(50);                       /* Delay 50 ms                        */
        wr_reg(0x13, 0x1400);               /* VDV[4:0] for VCOM amplitude        */
        wr_reg(0x29, 0x000E);               /* VCM[4:0] for VCOMH                 */
        delay_ms(50);                       /* Delay 50 ms                        */
        wr_reg(0x20, 0x0000);               /* GRAM horizontal Address            */
        wr_reg(0x21, 0x0000);               /* GRAM Vertical Address              */

        /* Adjust the Gamma Curve ------------------------------------------------*/
        switch (driverCode) {
        case 0x5408:                      /* LCD with SPFD5408 LCD Controller   */
            wr_reg(0x30, 0x0B0D);
            wr_reg(0x31, 0x1923);
            wr_reg(0x32, 0x1C26);
            wr_reg(0x33, 0x261C);
            wr_reg(0x34, 0x2419);
            wr_reg(0x35, 0x0D0B);
            wr_reg(0x36, 0x1006);
            wr_reg(0x37, 0x0610);
            wr_reg(0x38, 0x0706);
            wr_reg(0x39, 0x0304);
            wr_reg(0x3A, 0x0E05);
            wr_reg(0x3B, 0x0E01);
            wr_reg(0x3C, 0x010E);
            wr_reg(0x3D, 0x050E);
            wr_reg(0x3E, 0x0403);
            wr_reg(0x3F, 0x0607);
            break;

        case 0x9325:                      /* LCD with RM68050 LCD Controller    */
            wr_reg(0x0030,0x0000);
            wr_reg(0x0031,0x0607);
            wr_reg(0x0032,0x0305);
            wr_reg(0x0035,0x0000);
            wr_reg(0x0036,0x1604);
            wr_reg(0x0037,0x0204);
            wr_reg(0x0038,0x0001);
            wr_reg(0x0039,0x0707);
            wr_reg(0x003C,0x0000);
            wr_reg(0x003D,0x000F);
            break;

        case 0x9320:                      /* LCD with ILI9320 LCD Controller    */
        default:                          /* LCD with other LCD Controller      */
            wr_reg(0x30, 0x0006);
            wr_reg(0x31, 0x0101);
            wr_reg(0x32, 0x0003);
            wr_reg(0x35, 0x0106);
            wr_reg(0x36, 0x0B02);
            wr_reg(0x37, 0x0302);
            wr_reg(0x38, 0x0707);
            wr_reg(0x39, 0x0007);
            wr_reg(0x3C, 0x0600);
            wr_reg(0x3D, 0x020B);
            break;
        }

        /* Set GRAM area ---------------------------------------------------------*/
        wr_reg(0x50, 0x0000);               /* Horizontal GRAM Start Address      */
        wr_reg(0x51, (GLCDx_HEIGHT-1));      /* Horizontal GRAM End   Address      */
        wr_reg(0x52, 0x0000);               /* Vertical   GRAM Start Address      */
        wr_reg(0x53, (GLCDx_WIDTH-1));       /* Vertical   GRAM End   Address      */

        /* Set Gate Scan Line ----------------------------------------------------*/
        switch (driverCode) {
        case 0x5408:                      /* LCD with SPFD5408 LCD Controller   */
#if (GLCDx_MIRROR_Y)
            wr_reg(0x60, 0x2700);
#else
            wr_reg(0x60, 0x2700);
#endif
            break;
        case 0x9325:                      /* LCD with RM68050 LCD Controller    */
#if (GLCDx_MIRROR_Y)
            wr_reg(0x60, 0x2700);
#else
            wr_reg(0x60, 0xA700);
#endif
            break;

        case 0x9320:                      /* LCD with ILI9320 LCD Controller    */
#if (GLCDx_MIRROR_Y)
            wr_reg(0x60, 0xA700);
#else
            wr_reg(0x60, 0x2700);
#endif
            break;
        default:                          /* LCD with other LCD Controller      */
#if (GLCDx_MIRROR_Y)
            wr_reg(0x60, 0xA700);
#else
            wr_reg(0x60, 0x2700);
#endif
            break;
        }
        wr_reg(0x61, 0x0001);               /* NDL,VLE, REV                       */
        wr_reg(0x6A, 0x0000);               /* Set scrolling line                 */

        /* Partial Display Control -----------------------------------------------*/
        wr_reg(0x80, 0x0000);
        wr_reg(0x81, 0x0000);
        wr_reg(0x82, 0x0000);
        wr_reg(0x83, 0x0000);
        wr_reg(0x84, 0x0000);
        wr_reg(0x85, 0x0000);

        /* Panel Control ---------------------------------------------------------*/
        wr_reg(0x90, 0x0010);
        wr_reg(0x92, 0x0000);
        wr_reg(0x93, 0x0003);
        wr_reg(0x95, 0x0110);
        wr_reg(0x97, 0x0000);
        wr_reg(0x98, 0x0000);

        /* Set GRAM write direction
           I/D=11 (Horizontal : increment, Vertical : increment)                  */
#if (GLCDx_SWAP_XY == 1)
        /* AM=1   (address is updated in vertical writing direction)              */
        wr_reg(0x03, 0x1038);
#else
        /* AM=0   (address is updated in horizontal writing direction)            */
        wr_reg(0x03, 0x1030);
#endif

        wr_reg(0x07, 0x0137);               /* 262K color and display ON          */
    }

//  GPIOA->BSRR = 0x00000100;             /* Turn backlight on */

    return 0;
}

/**
  \fn          int32_t GLCDx_Uninitialize (void)
  \brief       De-initialize Graphic LCD
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCDx_Uninitialize (void) {

//  GPIOA->BRR = 0x00000100;              /* Turn backlight off */

