nieaowei/newlab-stm32-driver/LCD模块/LCD驱动实验/LCD_TOUCH/USER/LCD/GLCD_MCBSTM32EX.c
#if (GLCDx_SWAP_XY == 0)
    y = (y + Scroll) % GLCDx_HEIGHT;
#endif

    if (active_font == NULL) return -1;

    ch        -= active_font->offset;
    wb         = (active_font->width + 7)/8;
    ptr_ch_bmp = (uint8_t *)active_font->bitmap + (ch * wb * active_font->height);

    GLCDx_SetWindow(x, y, active_font->width, active_font->height);

    wr_cmd(0x22);
    wr_dat_start();

    for (i = 0; i < active_font->height; i++) {
        for (j = 0; j < active_font->width; j++) {
            wr_dat_only(((*ptr_ch_bmp >> (j & 7)) & 1) ? foreground_color : background_color);
            if (((j & 7) == 7) && (j != (active_font->width - 1))) ptr_ch_bmp++;
        }
        ptr_ch_bmp++;
    }
    wr_dat_stop();

    return 0;
}

/**
  \fn          int32_t GLCDx_DrawString (uint32_t x, uint32_t y, const char *str)
  \brief       Draw string (in active foreground color)
  \param[in]   x      x position in pixels (0 = left corner)
  \param[in]   y      y position in pixels (0 = upper corner)
  \param[in]   str    Null-terminated String
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCDx_DrawString (uint32_t x, uint32_t y, const char *str) {

    while (*str) {
        GLCDx_DrawChar(x, y, *str++);
        x += active_font->width;
    }

    return 0;
}

/**
  \fn          int32_t GLCDx_DrawBargraph (uint32_t x, uint32_t y, uint32_t width, uint32_t height, uint32_t val)
  \brief       Draw bargraph (in active foreground color)
  \param[in]   x      Start x position in pixels (0 = left corner)
  \param[in]   y      Start y position in pixels (0 = upper corner)
  \param[in]   width  Full bargraph width in pixels
  \param[in]   height Full bargraph height in pixels
  \param[in]   val    Active bargraph value (maximum value is 100)
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCDx_DrawBargraph (uint32_t x, uint32_t y, uint32_t width, uint32_t height, uint32_t val) {
    uint32_t i, j;

    val = (val * width) / 100;            /* Scale value                        */

#if (GLCDx_SWAP_XY == 0)
    y = (y + Scroll) % GLCDx_HEIGHT;
#endif

    GLCDx_SetWindow(x, y, width, height);

    wr_cmd(0x22);
    wr_dat_start();
    for (i = 0; i < height; i++) {
        for (j = 0; j < width; j++) {
            if(j >= val) {
                wr_dat_only(background_color);
            } else {
                wr_dat_only(foreground_color);
            }
        }
    }
    wr_dat_stop();

    return 0;
}

/**
  \fn          int32_t GLCDx_DrawBitmap (uint32_t x, uint32_t y, uint32_t width, uint32_t height, const uint8_t *bitmap)
  \brief       Draw bitmap (bitmap from BMP file without header)
  \param[in]   x      Start x position in pixels (0 = left corner)
  \param[in]   y      Start y position in pixels (0 = upper corner)
  \param[in]   width  Bitmap width in pixels
  \param[in]   height Bitmap height in pixels
  \param[in]   bitmap Bitmap data
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCDx_DrawBitmap (uint32_t x, uint32_t y, uint32_t width, uint32_t height, const uint8_t *bitmap) {
    int32_t   i, j;
    uint16_t *ptr_bmp;

    ptr_bmp = (uint16_t *)bitmap;

#if (GLCDx_SWAP_XY == 0)
    y = (y + Scroll) % GLCDx_HEIGHT;
#endif

    GLCDx_SetWindow(x, y, width, height);

    wr_cmd(0x22);
    wr_dat_start();
    for (i = (height-1)*width; i > -1; i -= width) {
        for (j = 0; j < width; j++) {
            wr_dat_only(ptr_bmp[i+j]);
        }
    }
    wr_dat_stop();

    return 0;
}

/**
  \fn          int32_t GLCDx_VScroll (uint32_t dy)
  \brief       Scroll picture on display vertically
  \param[in]   dy  Scroll size in pixels
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCDx_VScroll (uint32_t dy) {
#if (GLCDx_SWAP_XY == 0)
    uint32_t i;

    Scroll = (Scroll + dy) % GLCDx_HEIGHT;

    if (Himax) {
        wr_reg(0x01, 0x08);
        wr_reg(0x14, Scroll >> 8);          /* VSP MSB                            */
        wr_reg(0x15, Scroll & 0xFF);        /* VSP LSB                            */
    }
    else {
        wr_reg(0x6A, Scroll);
        wr_reg(0x61,  3);
    }

    /* Clear new space */
    GLCDx_SetWindow(0, Scroll, GLCDx_WIDTH, dy);

    wr_cmd(0x22);
    wr_dat_start();
    for(i = 0; i < (GLCDx_WIDTH * dy); i++) {
        wr_dat_only(background_color);
    }
    wr_dat_stop();

    return 0;
#else
    return -1;
#endif
}

/**
  \fn          int32_t GLCDx_FrameBufferAccess (bool enable)
  \brief       Enable or disable direct access to FrameBuffer
  \param[in]   enable Enable or disable request
                - true (1): enable
                - false(0): disable
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t  GLCDx_FrameBufferAccess (bool enable) {
    GLCDx_SetWindow(0, 0, GLCDx_WIDTH, GLCDx_HEIGHT);

    wr_reg (0x20, 0x0000);
    wr_reg (0x21, 0x0000);
    wr_cmd (0x22);
    return 0;
}

/**
  \fn          uint32_t GLCDx_FrameBufferAddress (void)
  \brief       Retrieve FrameBuffer address
  \returns     FrameBuffer address
*/
uint32_t GLCDx_FrameBufferAddress (void) {
    return (uint32_t)&LCD_DAT16;
}
